Create CSV file for product selling for 6 Months ( Prod_No | Prod_Name | Jan | Feb | Mar | Apr | May | Jun) for 5 products.

In [12]:
import csv

In [13]:
import pandas as pd

In [14]:
 data = [
     [1,"Apple",2400,4241,3242,4532,4500,3210],
     [2,"Banana",3000,3300,4200,4500,4220,2200],
     [3,"Mango",2100,2000,1000,2100,3200,1300],
     [4,"orange",2000,4500,6700,2300,3000,3900],
     [5,"kivi",4000,5400,2700,1230,4540,5410],
 ]

In [15]:
f=open("product.csv","w", newline="")

In [16]:
 w = csv.writer(f)

In [17]:
w.writerow(["Prod_No", "Prod_Name", "Jan", "Feb", "Mar", "Apr", "May", "Jun"])

43

In [18]:
w.writerows(data)

# Perform following operations.

1. Add 12 Records. Take input from user.

In [19]:
l=[]

In [20]:
for i in range(12):
    prod_no = input("Enter Product Number: ")
    prod_name = input("Enter Product Name: ")
    jan = int(input("Enter January Sales: "))
    feb = int(input("Enter February Sales: "))
    mar = int(input("Enter March Sales: "))
    apr = int(input("Enter April Sales: "))
    may = int(input("Enter May Sales: "))
    jun = int(input("Enter June Sales: "))
    t = [prod_no, prod_name, jan, feb, mar, apr, may, jun]
    l.append(t)

Enter Product Number: 11
Enter Product Name: apple
Enter January Sales: 3400
Enter February Sales: 7700
Enter March Sales: 5600
Enter April Sales: 5460
Enter May Sales: 4540
Enter June Sales: 4560
Enter Product Number: 12
Enter Product Name: banana
Enter January Sales: 345
Enter February Sales: 345
Enter March Sales: 365
Enter April Sales: 2134
Enter May Sales: 2310
Enter June Sales: 1001
Enter Product Number: 13
Enter Product Name: kivi
Enter January Sales: 5600
Enter February Sales: 5460
Enter March Sales: 3450
Enter April Sales: 3450
Enter May Sales: 3360
Enter June Sales: 3460
Enter Product Number: 14
Enter Product Name: orange
Enter January Sales: 3200
Enter February Sales: 2340
Enter March Sales: 1230
Enter April Sales: 3240
Enter May Sales: 4320
Enter June Sales: 2340
Enter Product Number: 15
Enter Product Name: mouse
Enter January Sales: 2340
Enter February Sales: 1230
Enter March Sales: 1238
Enter April Sales: 1234
Enter May Sales: 4590
Enter June Sales: 5460
Enter Product Number: 16
Enter Product Name: laptop
Enter January Sales: 3345
Enter February Sales: 4560
Enter March Sales: 4530
Enter April Sales: 3234
Enter May Sales: 1230
Enter June Sales: 139
Enter Product Number: 17
Enter Product Name: tv
Enter January Sales: 435
Enter February Sales: 345
Enter March Sales: 762
Enter April Sales: 654
Enter May Sales: 235
Enter June Sales: 435
Enter Product Number: 18
Enter Product Name: mobile
Enter January Sales: 3567
Enter February Sales: 7896
Enter March Sales: 23465
Enter April Sales: 345
Enter May Sales: 2354
Enter June Sales: 674
Enter Product Number: 19
Enter Product Name: table
Enter January Sales: 345
Enter February Sales: 578
Enter March Sales: 234
Enter April Sales: 768
Enter May Sales: 325
Enter June Sales: 678
Enter Product Number: 20
Enter Product Name: fen
Enter January Sales: 345
Enter February Sales: 567
Enter March Sales: 235
Enter April Sales: 6798
Enter May Sales: 345
Enter June Sales: 879
Enter Product Number: 21
Enter Product Name: bag
Enter January Sales: 345
Enter February Sales: 78
Enter March Sales: 234
Enter April Sales: 678
Enter May Sales: 234
Enter June Sales: 578
Enter Product Number: 22
Enter Product Name: shoes
Enter January Sales: 4325
Enter February Sales: 2134
Enter March Sales: 345
Enter April Sales: 563
Enter May Sales: 546
Enter June Sales: 567

In [27]:
f=open("product.csv","a", newline="")

In [28]:
 w = csv.writer(f)

In [29]:
w.writerows(l)

2. Create dataframe.

In [31]:
df = pd.read_csv("product.csv")

3. Change Column Name Product No, Product Name, January, February, March, April, May, June.

In [32]:
df.columns = ["Product No", "Product Name", "January", "February", "March", "April", "May", "June"]

In [33]:
print(df)

   Product No Product Name  January  February  March  April   May  June
0           1        Apple     2400      4241   3242   4532  4500  3210
1           2       Banana     3000      3300   4200   4500  4220  2200
2           3        Mango     2100      2000   1000   2100  3200  1300
3           4       orange     2000      4500   6700   2300  3000  3900
4           5         kivi     4000      5400   2700   1230  4540  5410

4. Add column "Total Sell" to count total of all month and "Average Sell"

In [34]:
#df["Total Sell"] = df.iloc[:, 2:].sum(axis=1)

In [36]:
#df["Average Sell"] = df.iloc[:, 2:8].mean(axis=1)

5. Add 2 row at the end.

In [42]:
new_rows = {'Product No': '', 'Product Name': '', 'January': '', 'February': '', 'March': '', 'April': '', 'May': '', 'June': ''}

In [63]:
#for i in range(2):
   # for column in rows:
        # rows[column] = input(f"Enter value for {column}: ")
        #df = df.append(rows, ignore_index=True)
       # df.reset_index(drop=True, inplace=True)

6. Add 2 row after 3rd row.

In [46]:
header=['Product No', 'Product Name', 'January', 'February', 'March', 'April', 'May', 'June','Total','Average']

In [47]:
df.loc[2.5] = [15, 'charger',120,728,746,425,374,202,260,4345.833]

In [48]:
df = df.sort_index().reset_index(drop=True)

In [49]:
df.loc[3.5] = [16, 'projecter',110,118,220,225,226,221,1170,188.3]

In [50]:
df = df.sort_index().reset_index(drop=True)

In [51]:
print(df)

   Product No Product Name  January  February  March  April   May  June  \
0           1        Apple     2400      4241   3242   4532  4500  3210
1           2       Banana     3000      3300   4200   4500  4220  2200
2           3        Mango     2100      2000   1000   2100  3200  1300
3          15      charger      120       728    746    425   374   202
4          16    projecter      110       118    220    225   226   221
5           4       orange     2000      4500   6700   2300  3000  3900
6           5         kivi     4000      5400   2700   1230  4540  5410

   Total Sell  Average Sell
0       22125   3687.500000
1       21420   3570.000000
2       11700   1950.000000
3         260   4345.833000
4        1170    188.300000
5       22400   3733.333333
6       23280   3880.000000

7. Print first 5 row.

In [52]:
print(df.head())

   Product No Product Name  January  February  March  April   May  June  \
0           1        Apple     2400      4241   3242   4532  4500  3210
1           2       Banana     3000      3300   4200   4500  4220  2200
2           3        Mango     2100      2000   1000   2100  3200  1300
3          15      charger      120       728    746    425   374   202
4          16    projecter      110       118    220    225   226   221

   Total Sell  Average Sell
0       22125      3687.500
1       21420      3570.000
2       11700      1950.000
3         260      4345.833
4        1170       188.300

8. Print Last 5 row.

In [53]:
print(df.tail())

   Product No Product Name  January  February  March  April   May  June  \
2           3        Mango     2100      2000   1000   2100  3200  1300
3          15      charger      120       728    746    425   374   202
4          16    projecter      110       118    220    225   226   221
5           4       orange     2000      4500   6700   2300  3000  3900
6           5         kivi     4000      5400   2700   1230  4540  5410

   Total Sell  Average Sell
2       11700   1950.000000
3         260   4345.833000
4        1170    188.300000
5       22400   3733.333333
6       23280   3880.000000

9. Print row 6 to 10.

In [54]:
print(df.iloc[5:10])

   Product No Product Name  January  February  March  April   May  June  \
5           4       orange     2000      4500   6700   2300  3000  3900
6           5         kivi     4000      5400   2700   1230  4540  5410

   Total Sell  Average Sell
5       22400   3733.333333
6       23280   3880.000000

10. Print only product name.

In [55]:
print(df["Product Name"])

0        Apple
1       Banana
2        Mango
3      charger
4    projecter
5       orange
6         kivi
Name: Product Name, dtype: object

11. Print sell of January month with product id and product name.

In [56]:
print(df[["Product No", "Product Name", "January"]])

   Product No Product Name  January
0           1        Apple     2400
1           2       Banana     3000
2           3        Mango     2100
3          15      charger      120
4          16    projecter      110
5           4       orange     2000
6           5         kivi     4000

12. Print only those product id , product name where january sell is > 5000 and February sell is >8000

In [57]:
print(df[(df["January"] > 5000) & (df["February"] > 8000)][["Product No", "Product Name"]])

Empty DataFrame
Columns: [Product No, Product Name]
Index: []

13. Print record in sorting order of Product name.

In [58]:
print(df.sort_values("Product Name"))

   Product No Product Name  January  February  March  April   May  June  \
0           1        Apple     2400      4241   3242   4532  4500  3210
1           2       Banana     3000      3300   4200   4500  4220  2200
2           3        Mango     2100      2000   1000   2100  3200  1300
3          15      charger      120       728    746    425   374   202
6           5         kivi     4000      5400   2700   1230  4540  5410
5           4       orange     2000      4500   6700   2300  3000  3900
4          16    projecter      110       118    220    225   226   221

   Total Sell  Average Sell
0       22125   3687.500000
1       21420   3570.000000
2       11700   1950.000000
3         260   4345.833000
6       23280   3880.000000
5       22400   3733.333333
4        1170    188.300000

 14. Display only odd index number column records

In [59]:
print(df.iloc[:, 1::2])

  Product Name  February  April  June  Average Sell
0        Apple      4241   4532  3210   3687.500000
1       Banana      3300   4500  2200   3570.000000
2        Mango      2000   2100  1300   1950.000000
3      charger       728    425   202   4345.833000
4    projecter       118    225   221    188.300000
5       orange      4500   2300  3900   3733.333333
6         kivi      5400   1230  5410   3880.000000

15. Display alternate row.

In [60]:
print(df.iloc[1::2,])

   Product No Product Name  January  February  March  April   May  June  \
1           2       Banana     3000      3300   4200   4500  4220  2200
3          15      charger      120       728    746    425   374   202
5           4       orange     2000      4500   6700   2300  3000  3900

   Total Sell  Average Sell
1       21420   3570.000000
3         260   4345.833000
5       22400   3733.333333